checkout_load_test_500users.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>

    <!-- ============================================================
         TEST PLAN
         สถานการณ์: จำลองผู้ใช้งาน 500 คน เข้ามาทำการสั่งซื้อสินค้า
                   (Checkout) พร้อมกัน เพื่อทดสอบความทนทานของระบบ
    ============================================================ -->
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan"
              testname="Checkout Load Test - 500 Users" enabled="true">
      <stringProp name="TestPlan.comments">
        สถานการณ์: ทดสอบความทนทานของระบบเมื่อมีผู้ใช้งาน 500 คน
        เข้ามายังหน้าชำระเงินพร้อมกัน
        วัดผล: Response Time, Throughput, Error Rate
      </stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables"
                   elementType="Arguments" guiclass="ArgumentsPanel"
                   testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="HOST" elementType="Argument">
            <stringProp name="Argument.name">HOST</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">5000</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>

    <hashTree>

      <!-- ============================================================
           THREAD GROUP: 500 Users, Ramp-Up 60 วินาที, Loop 3 ครั้ง
           (แต่ละ user ทำการสั่งซื้อ 3 รอบ)
      ============================================================ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="500 Users - Checkout Flow" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller"
                     elementType="LoopController" guiclass="LoopControlPanel"
                     testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <!-- Loop Count: แต่ละ User ทำซ้ำ 3 รอบ -->
          <stringProp name="LoopController.loops">3</stringProp>
        </elementProp>
        <!-- จำนวน Users: 500 -->
        <stringProp name="ThreadGroup.num_threads">500</stringProp>
        <!-- Ramp-Up: ทยอย spawn user ภายใน 60 วินาที -->
        <stringProp name="ThreadGroup.ramp_time">60</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>

      <hashTree>

        <!-- ============================================================
             HTTP REQUEST DEFAULTS (ใช้ตัวแปร ${HOST} และ ${PORT})
        ============================================================ -->
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement"
                           testname="HTTP Request Defaults" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                       guiclass="HTTPArgumentsPanel" testclass="Arguments"
                       testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">utf-8</stringProp>
          <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">10000</stringProp>
        </ConfigTestElement>
        <hashTree/>

        <!-- HTTP Header: Content-Type = application/json -->
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                       testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <!-- ============================================================
             STEP 1: Login เพื่อรับ JWT Token
             (ใช้ account ทดสอบที่มีอยู่แล้วในระบบ)
        ============================================================ -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="1. POST /api/auth/login" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
  "email": "test@example.com",
  "password": "password123"
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/auth/login</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- ดึง token จาก response body -->
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor"
                             testname="Extract JWT Token" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">auth_token</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.token</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">TOKEN_NOT_FOUND</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <!-- ตรวจสอบว่า Login สำเร็จ (HTTP 200) -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Assert Login Success" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Login failed - ตรวจสอบ email/password</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <!-- ============================================================
             STEP 2: ดึงรายการสินค้า (หน้า Shop / Products)
        ============================================================ -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="2. GET /api/products" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                       guiclass="HTTPArgumentsPanel" testclass="Arguments"
                       testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/products?limit=20&amp;page=1</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- ดึง Product ID ตัวแรกมาเพื่อใช้ทำ Order -->
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor"
                             testname="Extract Product ID" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">product_id</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.data[0]._id</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">PRODUCT_NOT_FOUND</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <!-- ดึง Product Name -->
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor"
                             testname="Extract Product Name" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">product_name</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.data[0].name</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">Test Product</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <!-- ดึง Product Price -->
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor"
                             testname="Extract Product Price" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">product_price</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.data[0].price</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">500</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <!-- Assert HTTP 200 -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Assert Products OK" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <!-- ============================================================
             STEP 3: ดูรายละเอียดสินค้า (หน้า Product Detail)
        ============================================================ -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="3. GET /api/products/{id}" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                       guiclass="HTTPArgumentsPanel" testclass="Arguments"
                       testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/products/${product_id}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>

        <!-- ============================================================
             STEP 4: สั่งซื้อสินค้า (Checkout / Create Order)
             ** หน้านี้คือจุดที่รับ Load หนักที่สุด **
        ============================================================ -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="4. POST /api/orders (CHECKOUT)" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
  "orderItems": [
    {
      "name": "${product_name}",
      "qty": 1,
      "image": "/images/sample.jpg",
      "price": ${product_price},
      "product": "${product_id}"
    }
  ],
  "shippingAddress": {
    "address": "123 ถนนทดสอบ Load Test",
    "city": "กรุงเทพมหานคร",
    "postalCode": "10110",
    "country": "Thailand"
  },
  "paymentMethod": "PromptPay",
  "itemsPrice": ${product_price},
  "taxPrice": 0,
  "shippingPrice": 50,
  "totalPrice": ${product_price}
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/orders</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- Authorization Header สำหรับ Checkout -->
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                         testname="Authorization Header - Checkout" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${auth_token}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <!-- ดึง Order ID เพื่อตรวจสอบ -->
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor"
                             testname="Extract Order ID" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">order_id</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.data._id</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">ORDER_NOT_FOUND</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <!-- Assert สร้าง Order สำเร็จ (HTTP 201) -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Assert Order Created" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">201</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Order creation failed!</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <!-- ============================================================
             STEP 5: ตรวจสอบรายการสั่งซื้อ (My Orders)
        ============================================================ -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="5. GET /api/orders (My Orders)" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                       guiclass="HTTPArgumentsPanel" testclass="Arguments"
                       testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/orders</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                         testname="Authorization Header - My Orders" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${auth_token}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>

        <!-- ============================================================
             LISTENERS: ดูผลลัพธ์ Response Time, Throughput, Error Rate
        ============================================================ -->

        <!-- View Results Tree: ดูผลรายคำขอ -->
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector"
                         testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>

        <!-- Summary Report: Response Time, Throughput, Error Rate รวม -->
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector"
                         testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>

        <!-- Aggregate Report: ดู Avg/Min/Max/90th percentile Response Time -->
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector"
                         testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>

        <!-- Response Time Graph: กราฟ Response Time ตามเวลา -->
        <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector"
                         testname="Response Time Graph" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>

      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>